papers/tsp-14-detection.html
---
comments: true
layout: page
title: Resilient Detection in the Presence of Integrity Attacks
---
<hr />

<p>
<b>Yilin Mo, Jo&atilde;o Hespanha and Bruno Sinopoli</b>
</p>

<p>
<i>IEEE Transactions on Signal Processing</i>, Jan 2014, Volume 62, Issue 1, Pages 31-43
</p>

<p>
Link to the <a href="../../../public/papers/j2011securedetection.pdf">paper</a>
</p>

<p>
If you want to leave any comments, you can annotate the <a href="../../../pdfviewer/viewer/web/viewer.html?file=%2Fpublic%2Fpapers%2Fj2011securedetection.pdf">pdf</a>. I will try to be responsive. You can also annotate this page or leave comments below. 
</p>

<div id="outline-container-org56f5523" class="outline-2">
<h2 id="org56f5523">Abstract</h2>
<div class="outline-text-2" id="text-org56f5523">
<p>
We consider the detection of a binary random state based on  m measurements that can be manipulated by an attacker. The attacker is assumed to have full information about the true value of the state to be estimated as well as the values of all the measurements. However, the attacker can only manipulate  n of the  m measurements. The detection problem is formulated as a minimax optimization, where one seeks to construct an optimal detector that minimizes the ¡°worst-case¡± probability of error against all possible manipulations by the attacker. We show that if the attacker can manipulate at least half the measurements  (n&ge; m/2) then the optimal worst-case detector should ignore all  m measurements and be based solely on the a-priori information. When the attacker can manipulate less than half of the measurements  (n&lt; m/2) , we show that the optimal detector is a threshold rule based on a Hamming-like distance between the (manipulated) measurement vector and two appropriately defined sets. For the special case where  n=(m-1)/2 , our results provide a constructive procedure to derive the optimal detector. We also design a heuristic detector for the case where  n&Lt; m , and prove the asymptotic optimality of the detector when  m&rarr;&infin;  . Finally we apply the proposed methodology in the case of i.i.d. Gaussian measurements.
</p>
</div>
</div>
